[
    {
        "id": 1,
        "img": "assets/img/blog/blog-1.png",
        "title": "Make America Food Secure Again",
        "text": "In the earliest days of the coronavirus panic, United States supermarkets saw meat shortages and  rising prices. However, our ranchers were still raising livestock for consumption and our fellow Americans were still demanding their steaks and chicken salad sandwiches. \n So, why did our farmers struggle to get their products in the hands of their hungry customers? \n The government-mandated lockdowns revealed a chokepoint in America's food supply chain. \n Just four large corporations dominate the beef processing market for the entire U.S.: JBS, Tyson Foods, Cargill, and Sysco. \n Even worse, two of the four companies, JBS and Cargill, are majority-owned by foreign entities. \n It is safe to say that the centralization of our beef production alone is a national security threat. Add to it that foreigners control half of the four beef mega-corps, and you can see that we have a problem on our hands. \n The problem is not limited to the hyper-consolidated beef industry, however. The nation's largest pork plants are owned by a Chinese company, Shuanghui International Holdings Limited, and operate under their U.S. alias \"Smithfield Foods.\" \n While Americans were struggling a year ago to find meat in the supermarkets, U.S. pork exports to China quadrupled. \n The political establishment in Washington has been consolidating power and wealth for decades. Still, the past four years have been a wake-up call to hard-working Americans around the nation. \n We are beginning to feel the consequences of centralized mega-companies partnered with an even more centralized mega-government. Tech companies, such as Google, Facebook, and Twitter, effectively control all of our online communications and unapologetically censor anyone who deviates from their leftist agenda. \n In January of this year, they went so far as to silence our own President of the United States, and have vowed to keep him off the platform even if he runs again. \n Many Americans have grown to understand the imminent threat caused by our monopolizing tech companies. \n Still, they have yet to recognize that the same concentration of wealth and power has quietly taken place in America's food distribution networks under the guise of \"common sense\" regulation. \n Thanks to regulators, just 50 slaughterhouses process 98% of America's beef. \n While the poultry and pork industries have undoubtedly undergone a similar centralization of production, the beef industry remains the giant elephant in the room. \n Fortunately for my neighbors in Wyoming and me, the sensible Red States still have enough power to hold back the overwhelming tide of our corrupt Federal government. \n In 2015, Wyoming led the way by passing America's first Food Freedom Act. This bill, introduced by former State Legislator Tyler Lindholm, sharply deregulated direct-to-consumer food sales by opening the way for independent farmers and small family operations to sell homemade foods. \n Since then, North Dakota, Maine, and Utah have passed similar laws, all without harming the general public. \n In 2020, Wyoming Governor Mark Gordon signed an expansion of the Food Freedom Act into law. This time, it circumvented federal meat regulations by letting ranchers create \"animal share\" agreements to sell cuts of animal meat directly to consumers. \n Ordinary people and small businesses benefit from the deregulation in our Red States like Wyoming. Unfortunately, much of America will remain beholden to the deep pockets of the mega-corps and the forked tongues of our politicians. \n Washington needs to take a lesson from the example laid out in Wyoming. \n A National Food Freedom Act that eliminates protectionist regulations put forth by the USDA and FDA and implemented in all fifty states would help revive rural American economies, enhance freedom, and improve long-term food security. \n More and more people recognize that Beltway insiders favor the donor's interests over their average constituencies' interests. Big-Tech, Big-Pharma, Big-Defence, Wall Street, and Big-Ag line the coffers of our politicians' super PACs in exchange for \"sensible\" regulations to keep out competition from small businesses. They deploy lobbyists into the halls of Congress with cash in hand to woo opportunistic politicians. \n The election of President Donald J. Trump was a shot across the bow aimed right at the yachts of the ruling elite. Hopefully, we will number their days of unfettered control with more small acts like subverting the corrupt meat industry. \n Let's Make American Food Secure Again. \n Farmers and ranchers across the nation should exercise their right and vote in legislators who will fight against the ever-suffocating regulations of the Feds. At the same time, Farmers should be wary of handouts and freebies from the government. When we take from them, we are taking money out of the pockets of our fellow hard-working Americans. \n Always remember, the government is not your friend, and neither are the politicians who unquestionably protect it.",
        "postdate": "01 Mar 2022",
        "author": "Catharine O’Neill",
        "tags": [
            {
                "name": "Biden Administration"
            },
            {
                "name": "Coronavirus"
            },
            {
                "name": "Trump Administration"
            },
            {
                "name": "America"
            },
            {
                "name": "Food"
            },
            {
                "name": "Farmers"
            },
            {
                "name": "Agriculture"
            }
        ],
        "commentcount": 501
    },
    {
        "id": 2,
        "img": "https://www.theamericanconservative.com/wp-content/uploads/2022/03/GettyImages-1198956303-scaled-e1646853504374.jpg",
        "title": "The Cracks Are Showing",
        "link": "https://www.theamericanconservative.com/articles/the-cracks-are-showing/",
        "postdate": "09 Mar 2022",
        "author": "George D. O'Neill Jr.",
        "tags": [
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            }
        ]
    },
    {
        "id": 3,
        "img": "https://images.dailycaller.com/image/width=1280,height=549,fit=cover,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2021/01/GettyImages-806924788-scaled-e1610744599719.jpg",
        "title": "Feds Regulate Cryptocurrencies Because They Hate Competition",
        "link": "https://dailycaller.com/2022/03/11/whiton-feds-regulate-cryptocurrencies-because-they-hate-competition/",
        "postdate": "11 Mar 2022",
        "author": "Christian Whiton",
        "tags": [
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            }
        ]
    }
]